CSI API ETABS v1

# cTowerAddCopyOfTower Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int AddCopyOfTower(
    	string TowerName,
    	string NewTowerName
    )

    Function AddCopyOfTower (
    	TowerName As String,
    	NewTowerName As String
    ) As Integer

    Dim instance As cTower
    Dim TowerName As String
    Dim NewTowerName As String
    Dim returnValue As Integer

    returnValue = instance.AddCopyOfTower(TowerName,
    	NewTowerName)

    int AddCopyOfTower(
    	String^ TowerName,
    	String^ NewTowerName
    )

    abstract AddCopyOfTower :
            TowerName : string *
            NewTowerName : string -> int

#### Parameters

TowerName

    Type: SystemString

NewTowerName

    Type: SystemString

#### Return Value

Type: Int32

See Also

#### Reference

cTower Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com